content/posts/weekly-summary-2023-04-23.en.md
+++
title = "Weekly Summary 2023-04-23"
date = 2023-04-30T10:22:00+10:00
lastmod = 2023-04-30T10:35:13+10:00
tags = ["weekly"]
draft = false
weight = 2001
featuredImage = "/ox-hugo/weekly-summary-2023-04-23-cover.jpeg"
featuredImagePreview = "/ox-hugo/weekly-summary-2023-04-23-preview.jpeg"
+++

The cover features my newly custom Cthulhu-style keycaps and an aviator cable. Love it!

<!--more-->


## What I Read {#what-i-read}


### [Keyboard tricks from a macOS app dev — Alin Panaitiu](https://notes.alinpanaitiu.com/Keyboard%20tricks%20from%20a%20macOS%20app%20dev) {#keyboard-tricks-from-a-macos-app-dev-alin-panaitiu}

This blog post was the main inspiration for me to begin setting up [yabai](https://github.com/koekeishiya/yabai) and [skhd](https://github.com/koekeishiya/skhd), which have opened up a whole new world of productivity for me.


### [I don’t want to sign up for your newsletter (2018) | Hacker News](https://news.ycombinator.com/item?id=35684807) {#i-don-t-want-to-sign-up-for-your-newsletter--2018--hacker-news}

I don't appreciate these newsletter signup pop-ups; what's the reason for me to want that?


## What I Watched {#what-i-watched}


### [Succession S1](https://www.imdb.com/title/tt7660850/episodes?season=1) {#succession-s1}

I've finished the first season, and it's indeed brilliant. When material needs reach their peak, the only thing that people genuinely care about and ponder is their spiritual needs.


### [Ant-Man and the Wasp: Quantumania (2023)](https://www.imdb.com/title/tt10954600/) {#ant-man-and-the-wasp-quantumania--2023}

The Marvel film is visually stunning but disappointing. The fourth phase of the Marvel universe doesn't offer much to see. Thankfully, I didn't waste money going to the cinema. However, how does [Paul Rudd](https://www.imdb.com/name/nm0748620/?ref_=tt_cl_i_1) manage to not age at all?


### [I played Tears of the Kingdom (spoiler-free hands-on impressions) - YouTube](https://www.youtube.com/watch?v=TESNhgSeTTw&ab_channel=SkillUp) {#i-played-tears-of-the-kingdom--spoiler-free-hands-on-impressions--youtube}

I simply can not wait any more! I want to play it NOW!

{{< youtube TESNhgSeTTw >}}


## What I Did {#what-i-did}


### [yabai](https://github.com/koekeishiya/yabai) &amp; [skhd](https://github.com/koekeishiya/skhd) {#yabai-and-skhd}

I'm surprised that I've only just discovered Yabai, such a handy window management tool. I can't get enough of it since I started using it! It has resolved many of the pain points I faced previously. Moreover, it gives me the opportunity to make full use of Mac's multiple desktops. I spent an evening setting it up on both my work and personal MacBook Pros. After using it for a week, I know I can't live without it.


### [Stow](https://www.gnu.org/software/stow/) {#stow}

My dotfiles management has always been a bit haphazard, but Yabai and SKHD made me realize that syncing dotfiles across multiple systems is becoming increasingly necessary. Previously, I used my own script for syncing, but this time I adopted Stow and moved my Emacs config over as well. I basically followed the setup provided by [System Crafters](https://www.youtube.com/@SystemCrafters) on YouTube.

{{< youtube 90xMTKml9O0 >}}


### [Sonos Era 100](https://www.sonos.com/en-au/shop/two-room-set-era-100-white) {#sonos-era-100}

I was very fortunate to buy the latest Sonos speaker, released just last month, at a 30% discount. It turned out that the discount code was due to an employee error, but Sonos generously honored the orders placed within that hour. I'm delighted with my purchase; now my home theater system feels complete. I used this setup to watch  [Ant-Man and the Wasp: Quantumania (2023)](https://www.imdb.com/title/tt10954600/) and the experience was quite impressive. My setup now:

-   [Arc](https://www.sonos.com/en-au/shop/arc)
-   [Sub](https://www.sonos.com/en-au/shop/sub)
-   [Sonos Era 100](https://www.sonos.com/en-au/shop/two-room-set-era-100-white)
